# St7SetPlateAverageNormals

Sets whether faceted plates are displayed with averaged normals.

long St7SetPlateAverageNormals(long uID, bool AverageNormals)

Input Parameters

uID

Strand7 model file ID.

AverageNormals

True to display plates with averaged normals.